# install commandline utils
brew 'ag'
brew 'awsebcli'
brew 'cmake'
brew 'duti'
brew 'fzf'
brew 'gist'
brew 'gnu-sed'
brew 'httpie'
brew 'lua'
brew 'node'
brew 'nvm'
brew 'rbenv'
brew 'ruby-build'
brew 'pandoc'
brew 'python'
brew 'tree'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'youtube-dl'

# install homebrew-cask
brew 'caskroom/cask/brew-cask'

# install apps
cask '1password'
cask 'alfred'
cask 'caffeine'
cask 'flux'
cask 'google-backup-and-sync'
cask 'hammerspoon'
cask 'imageoptim'
cask 'iterm2'
cask 'karabiner-elements'
cask 'ngrok'
cask 'postgres'
cask 'psequel'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
