# install commandline utils
brew 'ag'
brew 'awsebcli'
brew 'cmake'
brew 'fzf'
brew 'lua'
brew 'node'
brew 'nvm'
brew 'rbenv'
brew 'ruby-build'
brew 'tree'
brew 'tmux'
brew 'vim'
brew 'wget'

# install homebrew-cask
brew 'caskroom/cask/brew-cask'

# install apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'bettertouchtool'
cask 'cyberduck'
cask 'dash'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'macdown'
cask 'mjolnir'
cask 'ngrok'
cask 'private-internet-access'
cask 'seil'
cask 'skitch'
cask 'slack'
cask 'sublime-text'
cask 'transmission'
cask 'vlc'
