# install commandline utils
brew 'ag'
brew 'awsebcli'
brew 'cmake'
brew 'duti'
brew 'fzf'
brew 'httpie'
brew 'lua'
brew 'mongodb'
brew 'node'
brew 'nvm'
brew 'rbenv'
brew 'ruby-build'
brew 'pandoc'
brew 'tree'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'youtube-dl'

# install homebrew-cask
brew 'caskroom/cask/brew-cask'

# install apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'bettertouchtool'
cask 'caffeine'
cask 'cyberduck'
cask 'dash'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'heroku-toolbelt'
cask 'imageoptim'
cask 'iterm2'
cask 'macdown'
cask 'mjolnir'
cask 'ngrok'
cask 'plug'
cask 'postgres'
cask 'psequel'
cask 'seil'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'soundcast'
cask 'sublime-text'
cask 'torbrowser'
cask 'transmission'
cask 'xquartz'
cask 'vlc'
